{
    "hidden_act": "silu",
    "architectures": [
      "LlamaForCausalLM"
    ],
    "initializer_range": 0.02,
    "layer_norm_epsilon": 1e-05,
    "rms_norm_eps": 1e-06,
    "model_type": "llama",
    "hidden_size": 768,
    "intermediate_size": 3072,
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "num_key_value_heads": 6,
    "max_position_embeddings": 2048,
    "vocab_size": 4096,
    "attention_dropout": 0.1
  }