{
    "auto_map": {
      "AutoConfig": "configuration_mixtral.MixtralConfig",
      "AutoModel": "modeling_mixtral.MixtralModel",
      "AutoModelForSequenceClassification": "modeling_mixtral.MixtralForSequenceClassification",
      "AutoModelForCausalLM": "modeling_mixtral.MixtralForCausalLM",
      "AutoModelForMaskedLM": "modeling_mixtral.MixtralForMaskedLM"
    },
    "attention_dropout": 0.0,
    "classifier_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "pad_token_id": 3,
    "hidden_act": "silu",
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "max_position_embeddings": 32768,
    "model_type": "mixtral",
    "num_attention_heads": 12,
    "num_experts_per_tok": 2,
    "num_hidden_layers": 12,
    "num_key_value_heads": 6,
    "num_experts": 8,
    "output_router_logits": false,
    "rms_norm_eps": 1e-05,
    "rope_theta": 1000000.0,
    "router_aux_loss_coef": 0.01,
    "router_z_loss_coef": 0.01,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.36.0.dev0",
    "use_cache": true,
    "vocab_size": 4096,
    "_attn_implementation": "flash_attention_2",
    "is_causal": true
  }