{
    "auto_map": {
        "AutoConfig": "configuration_qwenmoe.Qwen2MoeConfig",
        "AutoModel": "modeling_qwenmoe.Qwen2MoeModel",
        "AutoModelForSequenceClassification": "modeling_qwenmoe.Qwen2MoeForSequenceClassification",
        "AutoModelForCausalLM": "modeling_qwenmoe.Qwen2MoeForCausalLM"
    },
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "pad_token_id": 3,
    "hidden_act": "silu",
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "max_position_embeddings": 32768,
    "max_window_layers": 10,
    "model_type": "qwen2_moe",
    "num_attention_heads": 8,
    "num_hidden_layers": 12,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-05,
    "rope_theta": 1000000.0,
    "sliding_window": 32768,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.39.0.dev0",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 4096,
    "decoder_sparse_step": 1,
    "moe_intermediate_size": 768,
    "shared_expert_intermediate_size": 3072,
    "num_experts_per_tok": 4,
    "num_experts": 28,
    "norm_topk_prob": false,
    "output_router_logits": true,
    "router_z_loss_coef": 0.001,
    "router_aux_loss_coef": 0.001
}